app/controllers/votes_controller.rb

  def index
    @votes = Vote.all
---
SELECT "votes".* FROM "votes"

  def show
    @vote = Vote.find_by(id: params[:id])
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @vote = Vote.new(vote_params)
    if @vote.save
---
INSERT INTO "votes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "123"], ["created_at", "2015-06-07 12:23:15.483863"], ["updated_at", "2015-06-07 12:23:15.483863"]]

  def destroy
    @vote = Vote.find_by(id: params[:id])
    if @vote.destroy
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 3]]

  def edit
    @vote = Vote.find_by(id: params[:id])
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @vote = Vote.find_by(id: params[:id])
    if @vote.update(vote_params)
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "votes" SET "name" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["name", "Tes"], ["updated_at", "2015-06-07 12:59:51.957996"], ["id", 1]]