app/views/votes/show.html.erb

<%= @vote.name %>
<% @vote.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."vote_id" = ?  [["vote_id", 4]]

    <%= question.text %>
    <% question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]